Tekla.Structures.ModelInternal.Dstv.DstvHoleType
Hole type

Tekla.Structures.ModelInternal.Dstv.DstvHoleType.NO_VALUE
Same as previous reference

Tekla.Structures.ModelInternal.Dstv.DstvHoleType.g
Thread

Tekla.Structures.ModelInternal.Dstv.DstvHoleType.l
Left threaded

Tekla.Structures.ModelInternal.Dstv.DstvHoleType.m
Mark, Trace

Tekla.Structures.ModelInternal.Dstv.DstvHoleType.s
Counter